# Advanced dataframe

## merging

In [ ]:
import pandas as pd

kiri = pd.DataFrame({
    'Id': [1,2,3],
    'Nama': ['Budi', 'Joko', 'Maya'],
    'Alamat' : ['Jakarta', 'Surabay', 'Medan']
})

kanan = kiri = pd.DataFrame({
    'Id': [1,2,3],
    'Nama': ['Jane', 'mike', 'dave'],
    'Alamat' : ['Semarang', 'Yogya', 'Solo']
})

print(kiri)
print(kanan)

   Id  Nama    Alamat
0   1  Jane  Semarang
1   2  mike     Yogya
2   3  dave      Solo
   Id  Nama    Alamat
0   1  Jane  Semarang
1   2  mike     Yogya
2   3  dave      Solo

In [ ]:
gabung = pd.merge(kiri, kanan, on='Id')
gabung

   Id Nama_x  Alamat_x Nama_y  Alamat_y
0   1   Jane  Semarang   Jane  Semarang
1   2   mike     Yogya   mike     Yogya
2   3   dave      Solo   dave      Solo

In [ ]:
import pandas as pd
karyawan = pd.DataFrame({
    'Nama': ['Budi', 'Joko', 'Maya'],
    'Alamat': ['Jakarta', 'Surabaya', 'Medan'],
    'Id Pekerjaan' : [1,7,2]
})

pekerjaan = pd.DataFrame({
    'Id Pekerjaan': [2,1,4,3],
    'Nama': ['Programmer', 'Data Engineer', 'Manager', 'Web Developer'],
    'Gaji' : [5000, 4000, 3000, 6000]
})

print(karyawan)
print(pekerjaan)

   Nama    Alamat  Id Pekerjaan
0  Budi   Jakarta             1
1  Joko  Surabaya             7
2  Maya     Medan             2
   Id Pekerjaan           Nama  Gaji
0             2     Programmer  5000
1             1  Data Engineer  4000
2             4        Manager  3000
3             3  Web Developer  6000

In [ ]:
gabung_merge = pd.merge(karyawan, pekerjaan, on='Id Pekerjaan',
                        how='left', sort=True)
gabung_merge

  Nama_x    Alamat  Id Pekerjaan         Nama_y    Gaji
0   Budi   Jakarta             1  Data Engineer  4000.0
1   Maya     Medan             2     Programmer  5000.0
2   Joko  Surabaya             7            NaN     NaN

In [ ]:
#menggunakan suffixes
gabung_merge = pd.merge(karyawan, pekerjaan, on='Id Pekerjaan', 
                        how='left', sort=True, suffixes=('_pegawai', '_pekerjaan'))
gabung_merge

  Nama_pegawai    Alamat  Id Pekerjaan Nama_pekerjaan    Gaji
0         Budi   Jakarta             1  Data Engineer  4000.0
1         Maya     Medan             2     Programmer  5000.0
2         Joko  Surabaya             7            NaN     NaN

## join

In [ ]:
import pandas as pd
karyawan = pd.DataFrame({
    'Nama': ['Budi', 'Joko', 'Maya'],
    'Alamat': ['Jakarta', 'Surabaya', 'Medan'],
    'Id' : [1,7,2]
})
pekerjaan = pd.DataFrame({
    'Id': [2,1,4,3],
    'Nama': ['Programmer', 'Data Engineer', 
             'Manager', 'Web Developer'],
    'Gaji' : [5000, 4000, 3000, 6000]
})
print(karyawan)
print(pekerjaan)

   Nama    Alamat  Id
0  Budi   Jakarta   1
1  Joko  Surabaya   7
2  Maya     Medan   2
   Id           Nama  Gaji
0   2     Programmer  5000
1   1  Data Engineer  4000
2   4        Manager  3000
3   3  Web Developer  6000

In [ ]:
#versi 1. hasil tidak sama dengan merge()
gabung_join = karyawan.join(pekerjaan, how='left', rsuffix='_pekerjaan')
gabung_join

   Nama    Alamat  Id  Id_pekerjaan Nama_pekerjaan  Gaji
0  Budi   Jakarta   1             2     Programmer  5000
1  Joko  Surabaya   7             1  Data Engineer  4000
2  Maya     Medan   2             4        Manager  3000

In [ ]:
#versi 2.hasil sama dengan merge()
gabung_join2 = karyawan.set_index('Id').join(pekerjaan.set_index('Id'), sort=True,
                                             how='left', rsuffix='_pekerjaan')
gabung_join2

    Nama    Alamat Nama_pekerjaan    Gaji
Id
1   Budi   Jakarta  Data Engineer  4000.0
2   Maya     Medan     Programmer  5000.0
7   Joko  Surabaya            NaN     NaN

## concat

In [ ]:
# menjadi baris baru. axis=0
kiri = pd.DataFrame({
    'Nama': ['Budi', 'Joko', 'Maya'],
    'Alamat' : ['Jakarta', 'Surabay', 'Medan']
})

kanan = kiri = pd.DataFrame({
    'Nama': ['Jane', 'mike', 'dave'],
    'Alamat' : ['Semarang', 'Yogya', 'Solo']
})

gabung_concat = pd.concat([kiri, kanan], axis=0, ignore_index=True)
gabung_concat

   Nama    Alamat
0  Jane  Semarang
1  mike     Yogya
2  dave      Solo
3  Jane  Semarang
4  mike     Yogya
5  dave      Solo

In [ ]:
# menjadi baris baru. axis=0
kiri = pd.DataFrame({
    'Nama': ['Budi', 'Joko', 'Maya'],
    'Alamat' : ['Jakarta', 'Surabay', 'Medan']
})

kanan = pd.DataFrame({
    'Nama': ['Jane', 'mike', 'dave'],
    'Gaji' : [5000, 4000, 3000]
})

gabung_concat = pd.concat([kiri, kanan], axis=0, ignore_index=True, join='outer')
gabung_concat

   Nama   Alamat    Gaji
0  Budi  Jakarta     NaN
1  Joko  Surabay     NaN
2  Maya    Medan     NaN
3  Jane      NaN  5000.0
4  mike      NaN  4000.0
5  dave      NaN  3000.0

In [ ]:
#gabung menjadi kolom baru. axis =1
kiri = pd.DataFrame({
    'Nama': ['Budi', 'Joko', 'Maya'],
    'Alamat' : ['Jakarta', 'Surabay', 'Medan']
})

kanan = pd.DataFrame({
    'Pekerjaan': ['Programmer', 'Data Engineer', 'Manager', 'Web Developer'],
    'Gaji' : [5000, 4000, 3000, 6000]
})

gabung_concat = pd.concat([kiri, kanan], axis=1, join='outer')
gabung_concat

   Nama   Alamat      Pekerjaan  Gaji
0  Budi  Jakarta     Programmer  5000
1  Joko  Surabay  Data Engineer  4000
2  Maya    Medan        Manager  3000
3   NaN      NaN  Web Developer  6000

## append

In [ ]:
kiri = pd.DataFrame({
    'Nama': ['Budi', 'Joko', 'Maya'],
    'Alamat' : ['Jakarta', 'Surabay', 'Medan']
})

kanan = pd.DataFrame({
    'Nama': ['Jane', 'mike', 'dave'],
    'Alamat' : ['Semarang', 'Yogya', 'Solo']
})

gabung_append = kiri.append(kanan, ignore_index=True)
gabung_append

   Nama    Alamat
0  Budi   Jakarta
1  Joko   Surabay
2  Maya     Medan
3  Jane  Semarang
4  mike     Yogya
5  dave      Solo

In [ ]:
#contoh perbedaan variable, index, parameter, argument, value
var1 = 'Hello world'
list1 = [1, 3, 5]

print(list1[2])

def jumlah(a, b):
  return a+b

print(jumlah(3,4))

5
7

## reset index

In [ ]:
kiri = pd.DataFrame({
    'Nama': ['Budi', 'Joko', 'Maya'],
    'Alamat' : ['Jakarta', 'Surabay', 'Medan']
})

kanan = pd.DataFrame({
    'Nama': ['Jane', 'mike', 'dave'],
    'Alamat' : ['Semarang', 'Yogya', 'Solo']
})

gabung_append = kiri.append(kanan)
gabung_append

   Nama    Alamat
0  Budi   Jakarta
1  Joko   Surabay
2  Maya     Medan
0  Jane  Semarang
1  mike     Yogya
2  dave      Solo

In [ ]:
new = gabung_append.reset_index(drop=True)
new

   Nama    Alamat
0  Budi   Jakarta
1  Joko   Surabay
2  Maya     Medan
3  Jane  Semarang
4  mike     Yogya
5  dave      Solo

## set_index

In [ ]:
kiri = pd.DataFrame({
    'ID' : ['001', '002', '003'],
    'Nama': ['Budi', 'Joko', 'Maya'],
    'Alamat' : ['Jakarta', 'Surabay', 'Medan']
})

print(kiri)

    ID  Nama   Alamat
0  001  Budi  Jakarta
1  002  Joko  Surabay
2  003  Maya    Medan

In [ ]:
kiri.iloc[2]

ID          003
Nama       Maya
Alamat    Medan
Name: 2, dtype: object

In [ ]:
kiri.set_index('ID', inplace=True)
kiri

     Nama   Alamat
ID
001  Budi  Jakarta
002  Joko  Surabay
003  Maya    Medan

In [ ]:
kiri.loc['003']

Nama       Maya
Alamat    Medan
Name: 003, dtype: object

## pivot table

In [ ]:
import pandas as pd

karyawan = pd.DataFrame({
   'Emp_id' : ['001','002','003','004','005','006'],
   'Nama': ['Budi', 'Joko', 'Maya', 'Andi', 'Dewi', 'Dian'],
   'Gender':['Pria', 'Pria', 'Perempuan', 'Pria', 'Perempuan', 'Perempuan'],
   'Pekerjaan': ['Programmer', 'Data Engineer', 'Programmer', 'Manager',
                      'Manager', 'Manager'],
   'Gaji':[5000, 4000, 5000, 6000, 8000, 6000]})
karyawan

  Emp_id  Nama     Gender      Pekerjaan  Gaji
0    001  Budi       Pria     Programmer  5000
1    002  Joko       Pria  Data Engineer  4000
2    003  Maya  Perempuan     Programmer  5000
3    004  Andi       Pria        Manager  6000
4    005  Dewi  Perempuan        Manager  8000
5    006  Dian  Perempuan        Manager  6000

In [ ]:
pivot_table = pd.pivot_table(karyawan, columns=['Gender', 'Pekerjaan'], aggfunc={'Gaji':'sum', 'Pekerjaan':'count'})
pivot_table

Gender    Perempuan                     Pria
Pekerjaan   Manager Programmer Data Engineer Manager Programmer
Gaji          14000       5000          4000    6000       5000
Pekerjaan         2          1             1       1          1

In [ ]:
#cara kedua pakai numpy untuk menghitung sum, mean, dan lain lain
import numpy as np
pivot_table = pd.pivot_table(karyawan, columns=['Gender', 'Pekerjaan'], aggfunc={'Gaji': np.sum, 'Pekerjaan':'count'})
pivot_table

Gender    Perempuan                     Pria
Pekerjaan   Manager Programmer Data Engineer Manager Programmer
Gaji          14000       5000          4000    6000       5000
Pekerjaan         2          1             1       1          1

## melt

In [ ]:
import pandas as pd
mahasiswa = pd.DataFrame({
   'Mhs_id' : ['001','002','003'],
   'Nama': ['Budi', 'Joko', 'Maya'],
   'Bhs Inggris':[100, 90, 98],
   'Matematika': [90, 87, 72],
   'Ekonomi':[90, 80, 78]})
mahasiswa

  Mhs_id  Nama  Bhs Inggris  Matematika  Ekonomi
0    001  Budi          100          90       90
1    002  Joko           90          87       80
2    003  Maya           98          72       78

In [ ]:
melt_table = pd.melt(mahasiswa, id_vars=['Mhs_id', 'Nama'], value_vars=['Bhs Inggris', 'Matematika', 'Ekonomi'])
melt_table

  Mhs_id  Nama     variable  value
0    001  Budi  Bhs Inggris    100
1    002  Joko  Bhs Inggris     90
2    003  Maya  Bhs Inggris     98
3    001  Budi   Matematika     90
4    002  Joko   Matematika     87
5    003  Maya   Matematika     72
6    001  Budi      Ekonomi     90
7    002  Joko      Ekonomi     80
8    003  Maya      Ekonomi     78

## lambda function

In [ ]:
x = lambda var1, var2 : var1 + var2
hasil = x(10, 12)
hasil

22

In [ ]:
test = lambda var1 : var1 * 2
hasil = test(5)
hasil

10

In [ ]:
import pandas as pd
mahasiswa = pd.DataFrame({
   'Mhs_id' : ['001','002','003'],
   'Nama': ['Budi', 'Joko', 'Maya'],
   'Matematika': [90, 47, 72]})
mahasiswa

  Mhs_id  Nama  Matematika
0    001  Budi          90
1    002  Joko          47
2    003  Maya          72

In [ ]:
mahasiswa['Grade'] = mahasiswa['Matematika'].apply(lambda nilai : 
                                                   'A' if nilai >=90 else('B' if nilai >=70 and nilai <90 else ('C')))
mahasiswa

  Mhs_id  Nama  Matematika Grade
0    001  Budi          90     A
1    002  Joko          47     C
2    003  Maya          72     B

In [ ]:
# Ternary
if nilai >= 90:
  print('A')
elif nilai